roomorama-devtest/app/controllers/api/v1/shortened_urls_controller.rb

INSERT INTO `shortened_urls` (`created_at`, `unique_key`, `updated_at`, `url`) VALUES ('2014-04-13 02:29:10', 'jikj8', '2014-04-13 02:29:10', 'http://google.ca')
---
  def create
    check = validate_link(params[:link][:url])
    @source_link = params[:link][:url]

    if  !check.nil?
      obj_params = params.require(:link).permit(:url)
      @saved_obj = Shortener::ShortenedUrl.new(obj_params)
      @saved_obj.save