blog/app/controllers/api/v1/articles_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 1 ORDER BY `articles`.`id` DESC LIMIT 1
---
      def index

        arr1 = []
        current_user.articles.each do |a|

INSERT INTO `articles` (`author_name`, `content`, `created_at`, `name`, `published_at`, `updated_at`, `user_id`) VALUES (NULL, 'ANOTHER content from api', '2013-03-30 04:23:59', 'API post', NULL, '2013-03-30 04:23:59', 1)
UPDATE `articles` SET `published_at` = '2013-03-30 04:14:03', `updated_at` = '2013-03-30 04:14:03' WHERE `articles`.`id` = 6
---
      def create
        @article = Article.create(:name => params[:name], :content => params[:content], :user_id => current_user.id)
        @article.published_at =@article.created_at
        @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 15 LIMIT 1
INSERT INTO `comments` (`comment`, `commentable_id`, `commentable_type`, `created_at`, `title`, `updated_at`, `user_id`) VALUES ('asdf', 15, 'Article', '2013-03-31 09:24:02', 'N/A', '2013-03-31 09:24:02', 2)
---
      def comment
        article = Article.find(params[:id])
        comment = article.comments.create(:title => "N/A", :comment => params[:comment], :user_id => current_user.id)

SELECT `categories`.* FROM `categories`
---
      def categories
        arr1 = []
        Category.all.each do |a|

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 15 LIMIT 1
---
      def comments
        arr1 = []
        article = Article.find(params[:id])