roomorama-devtest/app/controllers/shortener/shortened_urls_controller.rb

SELECT `shortened_urls`.* FROM `shortened_urls` WHERE `shortened_urls`.`unique_key` = 'fd2ub' LIMIT 1
UPDATE `shortened_urls` SET `use_count` = 5, `updated_at` = '2014-04-10 01:38:37' WHERE `shortened_urls`.`id` = 12
---
  def show
    token = /^([#{Shortener.key_chars.join}]*).*/.match(params[:id])[1]

    sl = ::Shortener::ShortenedUrl.find_by_unique_key(token)
    @str_link = ""

    if sl
      Thread.new do
        sl.increment!(:use_count)

INSERT INTO `shortened_urls` (`created_at`, `unique_key`, `updated_at`, `url`) VALUES ('2014-04-10 01:12:52', 'vtoz2', '2014-04-10 01:12:52', 'nytimes')
---
  def create
    check = validate_link(params[:shortener_shortened_url][:url])

    if  !check.nil?
      obj_params = params.require(:shortener_shortened_url).permit(:url)
      @saved_obj = Shortener::ShortenedUrl.new(obj_params)
      @saved_obj.save