BackEndChallenge_002/app/controllers/game_controller.rb

  def create
    #specify whether user is waiting for adversary?
    is_waiting = true
    if params[:adversary_game].blank?
      obj_params = params.require(:game).permit(:name)
      @game = Game.create(obj_params)
    else
      @game = Game.find_by_name(params[:adversary_game])
      is_waiting = false
    end
    if !@game.nil?
      @player = Player.create(:name => SecureRandom.hex(10), :game_id => @game.id, :moves => params[:player_moves])
---
INSERT INTO `games` (`created_at`, `name`, `updated_at`) VALUES ('2014-05-02 02:15:39', '50afc200724858d9ff8a', '2014-05-02 02:15:39')
SELECT `games`.* FROM `games` WHERE `games`.`name` = 'asdf' LIMIT 1
INSERT INTO `player_moves` (`created_at`, `moves`, `player_id`, `updated_at`) VALUES ('2014-05-02 03:32:25', 'R,P,S,L,S,P,S,R,L,Sp,', 10, '2014-05-02 03:32:25')
INSERT INTO `players` (`created_at`, `game_id`, `moves`, `name`, `updated_at`) VALUES ('2014-05-02 10:22:03', 123, 'Rock,Rock,Rock,Rock,Rock,Rock,Rock,Rock,Rock,Rock,', '99b17bee3ae637da6fba', '2014-05-02 10:22:03')

  def show
    @game = Game.find(params[:id])
    if @game
      @current_player = Player.find(params[:player_id])
---
SELECT `games`.* FROM `games` WHERE `games`.`id` = 3 LIMIT 1
SELECT `players`.* FROM `players` WHERE `players`.`game_id` = 11 AND (`players`.`player_id` != '11') ORDER BY `players`.`id` ASC LIMIT 1