blog/app/views/articles/edit.html.erb

SELECT `categories`.* FROM `categories` WHERE (id in (1,2,3))
SELECT `categories`.* FROM `categories`
---
  <div class="field">
    <% for c in Category.find(:all) %>
      <%= check_box_tag "category[]", c.id, @article.categories.map(&:id).include?(c.id) %>