blog/app/views/articles/new.html.erb

  <div class="field">
    <%= select("article", "category_id", Category.all.collect {|p| [ p.name, p.id ] }, {:include_blank => false}, :class => "span3") %>
---
SELECT `categories`.* FROM `categories`