blog/app/controllers/articles_controller.rb

INSERT INTO `articles` (`author_name`, `content`, `created_at`, `name`, `published_at`, `updated_at`, `user_id`) VALUES (NULL, 'Article no 1', '2013-03-30 04:22:21', 'Article no 1', NULL, '2013-03-30 04:22:21', 1)
INSERT INTO `article_scopes` (`article_id`, `category_id`, `created_at`, `updated_at`) VALUES (11, 1, '2013-03-31 07:28:03', '2013-03-31 07:28:03')
---
  def create
    @article = Article.new(params[:article])
    @article.user = current_user
    @article.save
    @article.save
    params[:category].each do |c|
      ArticleScope.create(:article => @article, :category_id => c)

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `content` = 'Dat Ngo [edited]', `updated_at` = '2013-03-30 02:31:22' WHERE `articles`.`id` = 1
---
  def update
    @article = Article.find(params[:id])
    if @article.update_attributes(params[:article])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 12 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 12
---
  def destroy
    article = Article.find(params[:id])
    article.destroy

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`comment`, `commentable_id`, `commentable_type`, `created_at`, `title`, `updated_at`, `user_id`) VALUES ('asd', 1, 'Article', '2013-03-31 02:50:56', 'N/A', '2013-03-31 02:50:56', 1)
---
  def comment
    article = Article.find(params[:id])
    @comment = article.comments.create(:title => "N/A", :comment => params[:line], :user_id => current_user.id)

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 14 LIMIT 1
UPDATE `articles` SET `published_at` = '2013-03-31 08:35:39', `updated_at` = '2013-03-31 08:35:39' WHERE `articles`.`id` = 14
---
  def publish
    article = Article.find(params[:id])
    article.published_at = Time.now
    article.save