blog/app/controllers/categories_controller.rb

INSERT INTO `categories` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-03-31 04:04:48', 'cate 1', 'cate 1', '2013-03-31 04:04:48')
---
  def create
    @category  = Category.new(params[:category])
    @category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `description` = 'cate 1 ed', `updated_at` = '2013-03-31 04:11:17' WHERE `categories`.`id` = 1
---
  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(params[:category])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
SELECT `article_scopes`.* FROM `article_scopes` WHERE `article_scopes`.`id` = 3
DELETE FROM `article_scopes` WHERE `article_scopes`.`id` = 3
DELETE FROM `categories` WHERE `categories`.`id` = 3
---
  def destroy
    category = Category.find(params[:id])
    arr =ArticleScope.where(:id => category.id)
    arr.each do |a|
      a.destroy
    end
    category.destroy