blog/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `password_digest`, `updated_at`) VALUES ('2013-03-30 02:24:24', 'ngothiendat@gmail.com', '$2a$10$3DnFL7ZVG2u4P8rOwCEnTupMk3XQk8bxy4Nc0Zj9oLIszp9V1FKwi', '2013-03-30 02:24:24')